NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_application.svd
            <register>
              <name>XIPCTRL</name>
              <description>XIP_CTRL - XIP Control Register</description>
              <addressOffset>0x108</addressOffset>
              <access>read-write</access>
              <resetValue>0x08000400</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>FRF</name>
                  <description>SPI Frame Format</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SPI_STANDARD</name>
                      <description>Standard SPI Format</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_DUAL</name>
                      <description>Dual SPI Format</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_QUAD</name>
                      <description>Quad SPI Format</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_OCTAL</name>
                      <description>Octal SPI Format</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TRANSTYPE</name>
                  <description>Address and instruction transfer format.</description>
                  <lsb>2</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TT0</name>
                      <description>Instruction and Address will be sent in Standard SPI Mode.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT1</name>
                      <description>Instruction will be sent in Standard SPI Mode and Address will be sent in the mode specified by XIP_CTRL.SPI_FRF.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT2</name>
                      <description>Both Instruction and Address will be sent in the mode specified by XIP_CTRL.SPI_FRF.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT3</name>
                      <description>Dual Octal mode, the address and instruction are transferred in octal mode and data is transferred on 16 data lines.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ADDRL</name>
                  <description>This bit defines Length of Address to be transmitted. Only after this much bits are programmed in to the FIFO the transfer can begin.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ADDR_L0</name>
                      <description>No Address</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L4</name>
                      <description>4 bit Address length</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L8</name>
                      <description>8 bit Address length</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L12</name>
                      <description>12 bit Address length</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L16</name>
                      <description>16 bit Address length</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L20</name>
                      <description>20 bit Address length</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L24</name>
                      <description>24 bit Address length</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L28</name>
                      <description>28 bit Address length</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L32</name>
                      <description>32 bit Address length</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L36</name>
                      <description>36 bit Address length</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L40</name>
                      <description>40 bit Address length</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L44</name>
                      <description>44 bit Address length</description>
                      <value>0xB</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L48</name>
                      <description>48 bit Address length</description>
                      <value>0xC</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L52</name>
                      <description>52 bit Address length</description>
                      <value>0xD</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L56</name>
                      <description>56 bit Address length</description>
                      <value>0xE</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L60</name>
                      <description>60 bit Address length</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDXIPCTRL8</name>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INSTL</name>
                  <description>Enhanced SPI mode instruction length in bits.</description>
                  <lsb>9</lsb>
                  <msb>10</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INST_L0</name>
                      <description>No Instruction</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L4</name>
                      <description>4 bit Instruction length</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L8</name>
                      <description>8 bit Instruction length</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L16</name>
                      <description>16 bit Instruction length</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSPICTRLR011</name>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>MDBITSEN</name>
                  <description>Mode bits enable in XIP mode. If this bit is set to 1, then in XIP mode of operation MSPI CORE will insert mode bits after the address phase. These bits are set in register XIP_MODE_BITS register.</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                </field>
                <field>
                  <name>WAITCYCLES</name>
                  <description>Wait cycles in SPI mode between control frames transmit and data transmit/reception. Specified as number of SPI clock cycles.</description>
                  <lsb>13</lsb>
                  <msb>17</msb>
                </field>
                <field>
                  <name>DFSHC</name>
                  <description>Fix DFS for XIP transfers. If this bit is set to 1 then data frame size for XIP transfers will be fixed to the programmed value in CTRLR0.DFS. The number of data frames to fetch will be determined by HSIZE and HBURST signals. If this bit is set to 0 then data frame size and number of data frames to fetch will be determined by HSIZE and HBURST signals</description>
                  <lsb>18</lsb>
                  <msb>18</msb>
                </field>
                <field>
                  <name>RSVDXIPCTRL19</name>
                  <lsb>19</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDXIPCTRL20</name>
                  <lsb>20</lsb>
                  <msb>20</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDXIPCTRL21</name>
                  <lsb>21</lsb>
                  <msb>21</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INSTEN</name>
                  <description>XIP instruction enable bit. If this bit is set to 1 then XIP transfers will also have instruction phase. The instruction op-codes will be chosen from XIP_INCR_INST or XIP_WRAP_INST registers bases on AHB transfer type.</description>
                  <lsb>22</lsb>
                  <msb>22</msb>
                </field>
                <field>
                  <name>CONTXFEREN</name>
                  <description>Enable continuous transfer in XIP mode. If this bit is set to 1 then continuous transfer mode in XIP will be enabled, in this mode MSPI CORE will keep target selected until a non-XIP transfer is detected on the AHB interface.</description>
                  <lsb>23</lsb>
                  <msb>23</msb>
                </field>
                <field>
                  <name>RSVDXIPCTRL24</name>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDXIPCTRL25</name>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPMBL</name>
                  <description>XIP Mode bits length. Sets the length of mode bits in XIP mode of operation. These bits are valid only when XIP_CTRL.XIP_MD_BIT_EN is set to 1.</description>
                  <lsb>26</lsb>
                  <msb>27</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MBL_2</name>
                      <description>Mode bits length equal to 2</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL_4</name>
                      <description>Mode bits length equal to 4</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL_8</name>
                      <description>Mode bits length equal to 8</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL_16</name>
                      <description>Mode bits length equal to 16</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDXIPCTRL28</name>
                  <lsb>28</lsb>
                  <msb>28</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPPREFETCHEN</name>
                  <description>Enables XIP pre-fetch functionality in MSPI CORE.</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                </field>
                <field>
                  <name>RSVDXIPCTRL30</name>
                  <lsb>30</lsb>
                  <msb>30</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDXIPCTRL</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>XIPSER</name>
              <description>XIP Target Enable Register</description>
              <addressOffset>0x10C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SER</name>
                  <description>Chip Select Enable Flag.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>RSVDSER</name>
                  <lsb>4</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>XRXOICR</name>
              <description>XIP Receive FIFO Overflow Interrupt Clear Register</description>
              <addressOffset>0x110</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>XRXOICR</name>
                  <description>Clear XIP Receive FIFO Overflow Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDXRXOICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>XIPCNTTIMEOUT</name>
              <description>XIP time out register for continuous transfers</description>
              <addressOffset>0x114</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>XTOC</name>
                  <description>XIP time out value in terms of hclk. Once target is selected in continuous XIP mode this counter will be used to de-select the target if there is no request for the time specified in the counter.</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>RSVDXTOC</name>
                  <lsb>8</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SPICTRLR1</name>
              <description>SPI Control 1 register</description>
              <addressOffset>0x118</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RSVDSPICTRLR102</name>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR134</name>
                  <lsb>3</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR158</name>
                  <lsb>5</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR1</name>
                  <lsb>9</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CSMINHIGH</name>
                  <description>Chip-Select Minimum HIGH period.</description>
                  <lsb>16</lsb>
                  <msb>19</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR12031</name>
                  <lsb>20</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
